IDENTIFICATION DIVISION.
PROGRAM-ID. GAR-ASSOC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARIAVEIS.
   05 WS-CONTRATOS.
      10 WS-COD-CONTRATO           PIC 9(04)    VALUE ZEROS.
      10 WS-COD-CLIENTE            PIC X(04)    VALUE SPACES.
      10 WS-TIPO-CREDITO           PIC X(11)    VALUE SPACES.
      10 WS-SALDO-DEVEDOR          PIC 9(04)V99 VALUE ZEROS.
      10 WS-PCT-GAR-EXIGIDA        PIC 9(03)    VALUE ZEROS.
   
   05 WS-VALORES.
      10 WS-TIPO-GARANTIA          PIC X(11)    VALUE SPACES.
      10 WS-VALOR-ORIGINAL         PIC 9(04)V99 VALUE ZEROS.
      10 WS-VALOR-ATUAL            PIC 9(04)V99 VALUE ZEROS.
      10 WS-VALOR-GAR-TOTAL        PIC 9(04)V99 VALUE ZEROS.
      
   05 WS-GARANTIAS.
      10 WS-GAR-MINIMA-EXIG        PIC 9(11)V99 VALUE ZEROS.
      10 WS-SIT-GARANTIA           PIC X(11)    VALUE SPACES.
  
   
PROCEDURE DIVISION.
A00-MAIN-LINE.

    PERFORM A01-INICIALIZACAO
       THRU A01-INICIALIZACAO-EXIT.
       
    PERFORM A02-COLETA-DADOS
       THRU A02-COLETA-DADOS-EXIT.
    
A00-MAIN-PROCEDURE-EXIT.
    EXIT.

A01-INICIALIZACAO.

    INITIALIZE WS-CONTRATO
    INITIALIZE WS-REGISTRO.

A01-INICIALIZACAO-EXIT.
    EXIT.
    
A02-COLETA-DADOS.

    DISPLAY 'CODIGO DE CONTRATO: ' 
    ACCEPT WS-COD-CONTRATO
    
    DISPLAY 'CODIGO DE CLIENTE: '
    ACCEPT WS-COD-CLIENTE
    
    DISPLAY 'TIPO DE CREDITO: '
    ACCEPT WS-TIPO-CREDITO
    
    DISPLAY 'SALDO DEVEDOR: '
    ACCEPT WS-SALDO-DEVEDOR
    
    DISPLAY 'PORCENTAGEM DE GARANTIA EXIGIDA: '
    ACCEPT WS-PCT-GAR-EXIGIDA.

A02-COLETA-DADOS-EXIT.
    EXIT.
    
A03-INFOS-COLETADAS.

    DISPLAY '**************************************'
    DISPLAY '------- GARANTIAS POR CONTRATO -------'
    DISPLAY '**************************************'
    DISPLAY 'CODIGO DE CONTRATO..................: ' WS-COD-CONTRATO
    DISPLAY 'CODIGO DE CLIENTE...................: ' WS-COD-CLIENTE
    DISPLAY 'SALDO DEVEDOR.......................: ' WS-SALDO-DEVEDOR
    DISPLAY 'GARANTIA MÍNIMA EXIGIDA.............: ' WS-PCT-GAR-EXIGIDA
    DISPLAY 'VALOR TOTAL DA GARANTIA.............: '
    DISPLAY 'SITUACAO DE GARANTIA................: ' 

A03-INFOS-COLETADAS-EXIT
    EXIT.

STOP RUN.
