IDENTIFICATION DIVISION.
PROGRAM-ID. GAR-ASSOC.
DATA DIVISION.
WORKING-STORAGE SECTION.
*> TABELA DE CONTRATOS
01 QTDE-CONTRATOS                  PIC 9(02) VALUE 3.

01 T-CONTRATOS.
   05 CONTRATO-ITEM                OCCURS 3 TIMES.
      10 COD-CONTRATO-CTR          PIC 9(04).
      10 COD-CLIENTE-CTR           PIC 9(04).
      10 SALDO-DEVEDOR-CTR         PIC 9(07)V99.
      10 PCT-GARANTIA-EXIG-CTR     PIC 9(03)V99.

*> VALORES DE TESTE
01 INICIALIZA-CONTRATOS.
   05 FILLER REDEFINES T-CONTRATOS.
      10 FILLER.
         15 COD-CONTRATO-CTR       VALUE 1001.
         15 COD-CLIENTE-CTR        VALUE 2001.
         15 SALDO-DEVEDOR-CTR      VALUE 100000.00.
         15 PCD-GARANTIA-EXIG-CTR  VALUE 120.00.
      10 FILLER.
         15 COD-CONTRATO-CTR       VALUE 1002.
         15 COD-CLIENTE-CTR        VALUE 2002.
         15 SALDO-DEVEDOR-CTR      VALUE 50000.00.
         15 PCD-GARANTIA-EXIG-CTR  VALUE 150.00.
      10 FILLER.
         15 COD-CONTRATO-CTR       VALUE 1003.
         15 COD-CLIENTE-CTR        VALUE 2003.
         15 SALDO-DEVEDOR-CTR      VALUE 30000.00.
         15 PCD-GARANTIA-EXIG-CTR  VALUE 120.00.
  
  *> TABELA DE GARANTIAS
  01 QTDE-GARANTIAS                PIC 9(02) VALUE 5.
  
  01 T-GARANTIAS.
     05 GARANTIA-ITEM              OCCURS 5 TIMES.
        10 COD-CONTRATO-GAR        PIC 9(04).
        10 TIPO-GARANTIA-GAR       PIC X(10).
        10 VALOR-ORIGINAL-GAR      PIC 9(07)V99.
        10 VALOR-ATUAL-GAR         PIC 9(07)V99.
        
*> VALORES DE TESTE
01 INICIALIZA-GARANTIAS.
   05 FILLER REDEFINES T-GARANTIAS.
      10 FILLER.
         15 COD-CONTRATO-GAR       VALUE 1001.
         15 TIPO-GARANTIA-GAR      VALUE 'HIPOTECA  '.
         15 VALOR-ORIGINAL-GAR     VALUE 150000.00.
         15 VALOR-ATUAL-GAR        VALUE 140000.00.
      10 FILLER.
         15 COD-CONTRATO-GAR       VALUE 1001.
         15 TIPO-GARANTIA-GAR      VALUE 'PENHOR    '.
         15 VALOR-ORIGINAL-GAR     VALUE 20000.00.
         15 VALOR-ATUAL-GAR        VALUE 180000.00.
      10 FILLER.
         15 COD-CONTRATO-GAR       VALUE 1002.
         15 TIPO-GARANTIA-GAR      VALUE 'HIPOTECA  '.
         15 VALOR-ORIGINAL-GAR     VALUE 90000.00.
         15 VALOR-ATUAL-GAR        VALUE 60000.00.
      10 FILLER.
         15 COD-CONTRATO-GAR       VALUE 1003.
         15 TIPO-GARANTIA-GAR      VALUE 'CAUCAO    '.
         15 VALOR-ORIGINAL-GAR     VALUE 60000.00.
         15 VALOR-ATUAL-GAR        VALUE 20000.00.
      10 FILLER.
         15 COD-CONTRATO-GAR       VALUE 1003.
         15 TIPO-GARANTIA-GAR      VALUE 'PENHOR    '.
         15 VALOR-ORIGINAL-GAR     VALUE 30000.00.
         15 VALOR-ATUAL-GAR        VALUE 15000.00.
         
*> VARIAVEIS DE TRABALHO
01 IDX-CONTRATO                    PIC 9(02).
01 IDX-GARANTIA                    PIC 9(02).

01 WS-COD-CONTRATO                 PIC 9(04).
01 WS-COD-CLIENTE                  PIC 9(04).
01 WS-SALDO-DEVEDOR                PIC 9(07)V99.
01 WS-PCT-GARANTIA-EXIG            PIC 9(03)V99.

01 WS-GARANTIA-TOTAL               PIC 9(09)V99.  
01 WS-GARANTIA-MINIMA              PIC 9(09)V99.
01 WS-LIMITE-EXCEDENTE             PIC 9(09)V99.

01 WS-SIT-GARANTIA                 PIC X(10).      
        
PROCEDURE DIVISION.
A00-MAIN-LINE.

    PERFORM A01-INICIALIZACAO
       THRU A01-INICIALIZACAO-EXIT.
       
    PERFORM A02-COLETA-DADOS
       THRU A02-COLETA-DADOS-EXIT.
    
A00-MAIN-PROCEDURE-EXIT.
    EXIT.

A01-INICIALIZACAO.

    INITIALIZE WS-CONTRATO
    INITIALIZE WS-REGISTRO.

A01-INICIALIZACAO-EXIT.
    EXIT.
    
A02-COLETA-DADOS.

  

A02-COLETA-DADOS-EXIT.
    EXIT.
    
A03-CONTROLE-GARANTIAS.

    DISPLAY '**************************************'
    DISPLAY '------- GARANTIAS POR CONTRATO -------'
    DISPLAY '**************************************'
    DISPLAY 'CODIGO DE CONTRATO..................: ' WS-COD-CONTRATO
    DISPLAY 'CODIGO DE CLIENTE...................: ' WS-COD-CLIENTE
    DISPLAY 'SALDO DEVEDOR.......................: ' WS-SALDO-DEVEDOR
    DISPLAY 'GARANTIA MÍNIMA EXIGIDA.............: ' WS-PCT-GAR-EXIGIDA
    DISPLAY 'VALOR TOTAL DA GARANTIA.............: '
    DISPLAY 'SITUACAO DE GARANTIA................: ' 

A03-CONTROLE-GARANTIAS-EXIT
    EXIT.

STOP RUN.
