IDENTIFICATION DIVISION.
PROGRAM-ID. BMICALCULATOR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WEIGHT PIC 999.
01 HEIGHT_INCHES PIC 999.
01 BMI    PIC 999V99.

PROCEDURE DIVISION.
0100-START-HERE.
    DISPLAY 'ENTER HEIGHT IN INCHES: '.
    ACCEPT HEIGHT_INCHES.
    DISPLAY 'ENTER WEIGHT IN POUNDS: '.
    ACCEPT WEIGHT.
    COMPUTE BMI = WEIGHT * 703 / (HEIGHT_INCHES * HEIGHT_INCHES).
    DISPLAY 'THE BMI IS ', BMI, '%'.
STOP RUN.
