*** Purpose: Criar um programa que leia os dados de um cliente (via ACCEPT) e exiba um resumo formatado (via DISPLAY).

IDENTIFICATION DIVISION.
PROGRAM-ID. CAD-CREDITO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM-PROPOSTA          PIC 9(04).
01 WS-NIF-CLIENTE           PIC 9(09).
01 WS-VALOR-SOLICITADO      PIC 9(04)V99.
01 WS-PRAZO-MESES           PIC 9(03).
01 WS-TAXA-JUROS            PIC 9(01)V9.
PROCEDURE DIVISION.
A00-MAIN-LINE.

    PERFORM A01-INICIALIZACAO
       THRU A01-INICIALIZACAO-EXIT.
    
    PERFORM A02-COLETA-DADOS
       THRU A02-COLETA-DADOS-EXIT.
      
    STOP RUN.

A00-MAIN-LINE-EXIT.
    EXIT.
    
A01-INICIALIZACAO.

    MOVE ZEROS      TO WS-NUM-PROPOSTA
                       WS-NIF-CLIENTE
                       WS-VALOR-SOLICITADO
                       WS-PRAZO-MESES
                       WS-TAXA-JUROS.
                       
A01-INICIALIZACAO-EXIT.
    EXIT.
    
A02-COLETA-DADOS.

    DISPLAY 'INFORME O NÚMERO DA PROPOSTA: '
    ACCEPT WS-NUM-PROPOSTA
    
    DISPLAY 'INFORME O NIF DO CLIENTE: '
    ACCEPT WS-NIF-CLIENTE
    
    PERFORM A03-VALIDA-NIF
       THRU A03-VALIDA-NIF-EXIT    
    
    DISPLAY 'VALOR DE CRÉDITO SOLICITADO: € '
    ACCEPT WS-VALOR-SOLICITADO
    
    DISPLAY 'PRAZO PROPOSTO PARA PAGAMENTO, EM MESES: ' 
    ACCEPT WS-PRAZO-MESES
    
    DISPLAY 'TAXA DE JUROS IMPOSTA PARA O VALOR SOLICITADO: '
    ACCEPT WS-TAXA-JUROS
    
    PERFORM A04-INFORMACOES-COLETADAS
       THRU A04-INFORMACOES-COLETADAS-EXIT.
    
A02-COLETA-DADOS-EXIT.
    EXIT.
    
A03-VALIDA-NIF.

    IF WS-NIF-CLIENTE = 0 
        DISPLAY 'NIF OBRIGATÓRIO. NÃO É POSSÍVEL AVANÇAR!'
        PERFORM A05-FINALIZACAO
           THRU A05-FINALIZACAO-EXIT    
        STOP RUN
    ELSE
        CONTINUE
    END-IF.

A03-VALIDA-NIF-EXIT.
    EXIT.
    
A04-INFORMACOES-COLETADAS.

    DISPLAY '*- - - - - - - - - - - - - - - - - - *'
    DISPLAY '|   RESUMO DE DADOS PARA CRÉDITO     |'
    DISPLAY '*- - - - - - - - - - - - - - - - - - *'
    DISPLAY 'NÚMERO DA PROPOSTA..............: ' WS-NUM-PROPOSTA.
    DISPLAY 'NIF DO CLIENTE..................: ' WS-NIF-CLIENTE.
    DISPLAY 'VALOR SOLICITADO..............: € ' WS-VALOR-SOLICITADO.
    DISPLAY 'PRAZO (MESES)...................: ' WS-PRAZO-MESES.
    DISPLAY 'TAXA DE JUROS (%)...............: ' WS-TAXA-JUROS.

A04-INFORMACOES-COLETADAS-EXIT.
    EXIT.

A05-FINALIZACAO.

    DISPLAY 'FIM DE PROGRAMA'.

A05-FINALIZACAO-EXIT.
    EXIT.
