**** Purpose: Mostrar comandos COBOL (ACCEPT)

IDENTIFICATION DIVISION.
PROGRAM-ID. .
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 WS-MOSTRA            PIC X(10) VALUE SPACES.
    
PROCEDURE DIVISION.
        DISPLAY 'DIGITE ALGO: '
        ACCEPT WS-MOSTRA
        DISPLAY 'WS-MOSTRA: ' WS-MOSTRA ' ' 45 ' TEXTO...'
STOP RUN.


CONSOLE:
DIGITE ALGO: 
JESSICA
WS-MOSTRA: JESSICA    45 TEXTO...
