**** Purpose: Mostrar comandos COBOL (MOVE)

IDENTIFICATION DIVISION.
PROGRAM-ID. COMDMOVE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DATA              PIC X(10) VALUE SPACES.
01 FILLER REDEFINES WS-DATA.
    03 WS-DATA-DD       PIC 9(02).
    03 FILLER           PIC X.
    03 WS-DATA-MM       PIC 9(02).
    03 FILLER           PIC X.
    03 WS-DATA-AA       PIC X(04).
PROCEDURE DIVISION.

    DISPLAY "INICIO DO PROCESSAMENTO"

        MOVE "19" TO WS-DATA(01:02).
        MOVE "/" TO WS-DATA(03:01).
        MOVE "09" TO WS-DATA(04:02).
        MOVE "/" TO WS-DATA(06:01).
        MOVE "2022" TO WS-DATA(07:04).

    DISPLAY WS-DATA.
        MOVE WS-DATA(07:04) TO WS-DATA-AA.
    DISPLAY WS-DATA-AA.
STOP RUN.
