IDENTIFICATION DIVISION.
PROGRAM-ID. CONTADOR-REV.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CONT-REV         PIC 9(02) VALUE 10.

PROCEDURE DIVISION.
    PERFORM VARYING CONT-REV FROM 10 BY -1 UNTIL CONT-REV <= 0
        DISPLAY CONT-REV
    END-PERFORM.
    
    DISPLAY CONT-REV

    DISPLAY 'TERMINEI DE CONTAR'
STOP RUN.
