IDENTIFICATION DIVISION.
PROGRAM-ID. CONTADOR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CONT             PIC 9(02) VALUE ZEROS.
PROCEDURE DIVISION.
    PERFORM VARYING CONT FROM 0 BY 1 UNTIL CONT > 10
        DISPLAY CONT
    END-PERFORM.
    
    DISPLAY 'TERMINEI DE CONTAR'
STOP RUN.
