*** Purpose: Ler as duas datas (Validade e Pagamento). Se o pagamento > vencimento >> marcar como 'Crédito vencido', senão 'Pagamento em dia'.

IDENTIFICATION DIVISION.
PROGRAM-ID. CRED-VENC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DT-VALID.
   05 WS-ANO-VALID      PIC 9(4).
   05 WS-MES-VALID      PIC 9(2).
   05 WS-DIA-VALID      PIC 9(2).

01 WS-DT-PAGTO.
   05 WS-ANO-PAGTO      PIC 9(4).
   05 WS-MES-PAGTO      PIC 9(2).
   05 WS-DIA-PAGTO      PIC 9(2).

01 WS-DATA-VALID-COMP   PIC 9(8).
01 WS-DATA-PAGTO-COMP   PIC 9(8).

PROCEDURE DIVISION.
A00-MAIN-LINE.

    PERFORM A01-INICIALIZACAO
       THRU A01-INICIALIZACAO-EXIT.
    
    PERFORM A02-PROCESSAMENTO
       THRU A02-PROCESSAMENTO-EXIT.
       
    PERFORM A03-FINALIZACAO
       THRU A03-FINALIZACAO-EXIT.
      
    STOP RUN.

A00-MAIN-LINE-EXIT.
    EXIT.
    
A01-INICIALIZACAO.

    INITIALIZE         WS-DT-VALID
                       WS-DT-PAGTO
                       
    MOVE ZEROS      TO WS-DATA-VALID-COMP                    
                       WS-DATA-PAGTO-COMP.
                       
A01-INICIALIZACAO-EXIT.
    EXIT.
    
A02-PROCESSAMENTO.

    MOVE 2025       TO WS-ANO-VALID
    MOVE   09       TO WS-MES-VALID
    MOVE   08       TO WS-DIA-VALID 

    DISPLAY 'ANO DE PAGAMENTO DA PARCELA: '
    ACCEPT WS-ANO-PAGTO
    
    DISPLAY 'MÊS DE PAGAMENTO DA PARCELA: '
    ACCEPT WS-MES-PAGTO
    
    DISPLAY 'DIA DE PAGAMENTO DA PARCELA: '
    ACCEPT WS-DIA-PAGTO
    
    MOVE WS-ANO-VALID   TO WS-DATA-VALID-COMP(1:4)
    MOVE WS-MES-VALID   TO WS-DATA-VALID-COMP(5:2)
    MOVE WS-DIA-VALID   TO WS-DATA-VALID-COMP(7:2)
    
    MOVE WS-ANO-PAGTO   TO WS-DATA-PAGTO-COMP(1:4)
    MOVE WS-MES-PAGTO   TO WS-DATA-PAGTO-COMP(5:2)
    MOVE WS-DIA-PAGTO   TO WS-DATA-PAGTO-COMP(7:2)
    
    IF WS-DATA-PAGTO-COMP > WS-DATA-VALID-COMP
        DISPLAY 'CRÉDITO VENCIDO'
    ELSE
        DISPLAY 'PAGAMENTO EM DIA'
    END-IF.
    
A02-PROCESSAMENTO-EXIT.
    EXIT.

A03-FINALIZACAO.

    DISPLAY 'FIM DE PROGRAMA'.

A03-FINALIZACAO-EXIT.
    EXIT.
    
