*** Purpose: Programa que lê o tipo de garantia e valida se é aceita. Caso seja inválida, rejeita a operação.

IDENTIFICATION DIVISION.
PROGRAM-ID. GAR-CREDITO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TIPO-GARANTIA          PIC X(08).
PROCEDURE DIVISION.
A001-MAIN-LINE.

    PERFORM A002-INICIALIZACAO
       THRU A002-INICIALIZACAO-EXIT.
       
    PERFORM A003-PROCESSAMENTO
       THRU A003-PROCESSAMENTO-EXIT.
       
    PERFORM A004-FINALIZACAO
       THRU A004-FINALIZACAO-EXIT.

A001-MAIN-LINE-EXIT.
    EXIT.
    
A002-INICIALIZACAO.

    MOVE SPACES      TO WS-TIPO-GARANTIA.

A002-INICIALIZACAO-EXIT.
    EXIT.
    
A003-PROCESSAMENTO.

    DISPLAY 'TIPO DE GARANTIA: '
    ACCEPT WS-TIPO-GARANTIA
    
    IF FUNCTION TRIM (WS-TIPO-GARANTIA) EQUAL 'HIPOTECA'
       OR FUNCTION TRIM (WS-TIPO-GARANTIA) EQUAL 'PENHOR'
       OR FUNCTION TRIM (WS-TIPO-GARANTIA) EQUAL 'FIANÇA'
        DISPLAY 'GARANTIA ACEITA'
    ELSE
        DISPLAY 'GARANTIA NÃO ACEITA'
    END-IF.

A003-PROCESSAMENTO-EXIT.
    EXIT.
    
A004-FINALIZACAO.

    DISPLAY 'PROGRAMA ENCERRADO'
    STOP RUN.

A004-FINALIZACAO-EXIT.
    EXIT.
