IDENTIFICATION DIVISION.
PROGRAM-ID. OBTAININPUT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC A(20).

PROCEDURE DIVISION.
    0100-START-HERE.
        DISPLAY 'PLEASE ENTER YOUR NAME: '.
        ACCEPT NAME.
        DISPLAY 'NICE TO MEET YOU, ', NAME.
STOP RUN.


CONSOLE:
PLEASE ENTER YOUR NAME: 
JESSICA
NICE TO MEET YOU, JESSICA 
