**** Purpose: Mostrar comandos COBOL (ON SIZE ERROR - É uma instrução de tratamento de erro, é usado para tratar erros, por exemplo, quando você estoura
uma margem, um range, e também quando você trabalha com cálculos matemáticos. Quando trabalhamos com cálculos utilizamos o comando COMPUTE e adicionamos
ON SIZE ERROR, pois pode ser que o resultado do seu cálculo seja maior do que número de bites que estabelecemos quando criamos a variável).

IDENTIFICATION DIVISION.
PROGRAM-ID. ONSIZEER.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 WS-NUM-1                  PIC 9(02) VALUE ZEROS.
77 WS-NUM-2				     PIC 9(02) VALUE ZEROS.
77 WS-RESULT                 PIC 9(02) VALUE ZEROS.
PROCEDURE DIVISION.
P001-INICIO.
	PERFORM P100-CALC.
	PERFORM P999-FIM.
P100-CALC.

	DISPLAY 'DIGITE O PRIMEIRO NUMERO:  ' 
    ACCEPT WS-NUM-1

    DISPLAY 'DIGITE O SEGUNDO NUMERO:  ' 
    ACCEPT WS-NUM-2

	COMPUTE WS-RESULT = WS-NUM-1  *  WS-NUM-2
		    ON SIZE ERROR  PERFORM P800-ERRO
    END-COMPUTE

	DISPLAY 'CALCULO OK! RESULTADO:  ' WS-RESULT
    .
P800-ERRO.
	
	DISPLAY 'ERRO NO CALCULO. '
	PERFORM P999-FIM
	.
P999-FIM.
STOP RUN.


CONSOLE:
DIGITE O PRIMEIRO NUMERO:  
21
DIGITE O SEGUNDO NUMERO:  
35
ERRO NO CALCULO.

DIGITE O PRIMEIRO NUMERO:  
4
DIGITE O SEGUNDO NUMERO:  
2
CALCULO OK! RESULTADO:  08

