IDENTIFICATION DIVISION.
PROGRAM-ID. PARTIDA-FUT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 GOLS-TIME1    PIC 9(02).
01 GOLS-TIME2    PIC 9(02).
01 DIFERENCA     PIC 9(02).

PROCEDURE DIVISION.
    DISPLAY 'QUANTOS GOLS O TIME 1 FEZ? '
    ACCEPT GOLS-TIME1

    DISPLAY 'QUANTOS GOLS O TIME 2 FEZ? '
    ACCEPT GOLS-TIME2

    IF GOLS-TIME1 = GOLS-TIME2
        DISPLAY 'A DIFERENÇA ENTRE OS PLACARES FOI DE 00'
        DISPLAY 'EMPATE'
    ELSE
        IF GOLS-TIME1 > GOLS-TIME2
            COMPUTE DIFERENCA = GOLS-TIME1 - GOLS-TIME2
        ELSE
            COMPUTE DIFERENCA = GOLS-TIME2 - GOLS-TIME1
        END-IF

        DISPLAY 'A DIFERENÇA ENTRE OS PLACARES FOI DE ' DIFERENCA

        IF DIFERENCA >= 3
            DISPLAY 'GOLEADA'
        ELSE
            DISPLAY 'PARTIDA NORMAL'
        END-IF
    END-IF.

    STOP RUN.
