IDENTIFICATION DIVISION.
PROGRAM-ID. RISCO-CRED.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-SALARIO              PIC 9(06)V99.
01 WS-VALOR-SOLICITADO     PIC 9(06)V99.
01 WS-CALC-RISCO           PIC 9(05)V99.
01 WS-CALC-RISCO-ED        PIC ZZ9.99.
01 WS-RESULTADO            PIC X(40).
PROCEDURE DIVISION.
A001-MAIN-LINE.

    PERFORM A002-INICIALIZACAO
       THRU A002-INICIALIZACAO-EXIT

    PERFORM A003-PROCESSAMENTO
       THRU A003-PROCESSAMENTO-EXIT

    PERFORM A005-FINALIZACAO
       THRU A005-FINALIZACAO-EXIT.

A001-MAIN-LINE-EXIT.
    EXIT.

A002-INICIALIZACAO.

    MOVE ZEROS          TO WS-SALARIO
                           WS-VALOR-SOLICITADO
                           WS-CALC-RISCO

    MOVE SPACES         TO WS-RESULTADO.

A002-INICIALIZACAO-EXIT.
    EXIT.

A003-PROCESSAMENTO.

    PERFORM A004-TABELA-RISCO
       THRU A004-TABELA-RISCO-EXIT

    DISPLAY 'SALÁRIO MENSAL: € '
    ACCEPT WS-SALARIO

    IF WS-SALARIO = 0
        DISPLAY 'SALÁRIO INVÁLIDO'
        PERFORM A005-FINALIZACAO
           THRU A005-FINALIZACAO-EXIT
    END-IF
    
    DISPLAY 'VALOR SOLICITADO: € '
    ACCEPT WS-VALOR-SOLICITADO

    IF WS-VALOR-SOLICITADO = 0
        DISPLAY 'VALOR SOLICITADO INVÁLIDO'
        PERFORM A005-FINALIZACAO
           THRU A005-FINALIZACAO-EXIT 
    END-IF

    COMPUTE WS-CALC-RISCO ROUNDED = (WS-VALOR-SOLICITADO / WS-SALARIO) * 100
    MOVE WS-CALC-RISCO                            TO WS-CALC-RISCO-ED

    IF WS-CALC-RISCO <= 30
       MOVE 'RISCO BAIXO. CRÉDITO CONCEDIDO!'         TO WS-RESULTADO
    ELSE
       IF WS-CALC-RISCO <= 50
          MOVE 'RISCO MÉDIO. CRÉDITO EM AVALIAÇÃO!'   TO WS-RESULTADO
       ELSE
          MOVE 'RISCO ALTO. CRÉDITO NEGADO!'          TO WS-RESULTADO
       END-IF
    END-IF

    DISPLAY 'O PERCENTUAL COMPROMETIDO É ' WS-CALC-RISCO-ED '%'
    DISPLAY WS-RESULTADO.

A003-PROCESSAMENTO-EXIT.
    EXIT.

A004-TABELA-RISCO.

    DISPLAY '*- - - - - - - - - - - - - - - - - - - - - -*'
    DISPLAY '*             RISCO DE CRÉDITO              *'
    DISPLAY '*- - - - - - - - - - - - - - - - - - - - - -*'
    DISPLAY '|RISCO BAIXO = MENOR OU IGUAL A 30% DA RENDA|'
    DISPLAY '|RISCO MÉDIO = MENOR OU IGUAL A 50% DA RENDA|'
    DISPLAY '|RISCO ALTO  = MAIOR DO QUE 50% DA RENDA    |'
    DISPLAY '*- - - - - - - - - - - - - - - - - - - - - -*'.

A004-TABELA-RISCO-EXIT.
    EXIT.

A005-FINALIZACAO.

    DISPLAY 'PROGRAMA ENCERRADO'
    STOP RUN.

A005-FINALIZACAO-EXIT.
    EXIT.
