**** Purpose: Boletim escolar

IDENTIFICATION DIVISION.
PROGRAM-ID. SCHOOLREPORT.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 WS-NOME              PIC 99.
77 WS-MATERIA           PIC 99.
77 WS-NOTA1             PIC 99V9 VALUE ZEROS.
77 WS-NOTA2             PIC 99V9 VALUE ZEROS.
77 WS-NOTA3             PIC 99V9 VALUE ZEROS.
77 WS-NOTA4             PIC 99V9 VALUE ZEROS.
77 WS-MEDIA             PIC 99V9 VALUE ZEROS.
77 WS-STATUS            PIC 99.
77 WS-RESULTADO         PIC 99.
PROCEDURE DIVISION.

    DISPLAY 'NOME DO ALUNO: '
    ACCEPT WS-NOME
    
    DISPLAY 'MATERIA: '
    ACCEPT WS-MATERIA
    
    DISPLAY 'NOTA 1: '
    ACCEPT WS-NOTA1
    
    DISPLAY 'NOTA 2: '
    ACCEPT WS-NOTA2
    
    DISPLAY 'NOTA 3: '
    ACCEPT WS-NOTA3
    
    DISPLAY 'NOTA 4: '
    ACCEPT WS-NOTA4
    
    COMPUTE WS-RESULTADO = WS-NOTA1 + WS-NOTA2 + WS-NOTA3 + WS-NOTA4
    
    COMPUTE WS-MEDIA = WS-RESULTADO / 4.
    
    DISPLAY 'MEDIA: '
    ACCEPT WS-MEDIA
    
    DISPLAY 'STATUS: '
    ACCEPT WS-STATUS
    
    IF WS-MEDIA IS NOT NUMERIC THEN
    DISPLAY 'NOTAS INVALIDAS. TENTE NOVAMENTE!'
    
    IF WS-MEDIA >= 7
    DISPLAY 'MEDIA MAIOR QUE 7.'
    DISPLAY WS-STATUS 'APROVADO!' WS-STATUS
    ELSE
    DISPLAY 'MEDIA MENOR QUE 7.'
    DISPLAY WS-STATUS 'REPROVADO!' WS-STATUS
    
    
    STOP RUN.
END PROGRAM SCHOOLREPORT.



CONSOLE:
NOME DO ALUNO: 
MATERIA: 
NOTA 1: 
NOTA 2: 
NOTA 3: 
NOTA 4: 
MEDIA: 
STATUS: 
