**** Purpose: Mostrar comandos COBOL (UNSTRING - O comando UNSTRING quebra o conteúdo de uma string em partes e armazena nos campos que forem determinados.
No código abaixo vamos ver 5 formas diferentes de usar esse comando).

IDENTIFICATION DIVISION.
PROGRAM-ID. UNSTRING.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 WS-NOME-COMPLETO 		  PIC X(30) VALUE SPACES.
01 WS-NOME.
    03 WS-PRIM-NOME 	    PIC X(10) VALUE SPACES.
    03 WS-NOME-MEIO 	    PIC X(10) VALUE SPACES.
    03 WS-ULTI-NOME	 	    PIC X(10) VALUE SPACES.
77 WS-MOSTRA 			        PIC X(50) VALUE SPACES.
01 WS-COUNT.
    03 WS-PONTEIRO		    PIC 9(02) VALUE ZEROS. 
    03 WS-TOT-CAMPOS		  PIC 9(02) VALUE ZEROS.
    03 WS-TM-1            PIC 9(02) VALUE ZEROS.
    03 WS-TM-2            PIC 9(02) VALUE ZEROS.
    03 WS-TM-3            PIC 9(02) VALUE ZEROS.
PROCEDURE DIVISION.
    DISPLAY 'FORMA 1'
    INITIALISE WS-NOME-COMPLETO
               WS-NOME
               WS-MOSTRA
    MOVE 'MARIO CESAR CASTRO' TO WS-NOME-COMPLETO

    UNSTRING 
        WS-NOME-COMPLETO
        DELIMITED BY " "
        INTO WS-PRIM-NOME
             WS-NOME-MEIO
             WS-ULTI-NOME
    END-UNSTRING.

    DISPLAY 'WS-PRIM-NOME: ' WS-PRIM-NOME
    DISPLAY 'WS-NOME-MEIO: ' WS-NOME-MEIO
    DISPLAY 'WS-ULTI-NOME: ' WS-ULTI-NOME
    
    DISPLAY 'FORMA 2' 
    INITIALISE WS-NOME-COMPLETO
               WS-NOME
               WS-MOSTRA
               WS-COUNT
    MOVE 'MARIO CESAR CASTRO' TO WS-NOME-COMPLETO

    MOVE 3 			              TO WS-PONTEIRO
    UNSTRING 
    WS-NOME-COMPLETO
    DELIMITED BY " "
    INTO WS-PRIM-NOME
         WS-NOME-MEIO
         WS-ULTI-NOME
    WITH POINTER WS-PONTEIRO
    TALLYING IN  WS-TOT-CAMPOS                               * Mostra quantos campos você está utilizando
    END-UNSTRING.
    
    DISPLAY 'WS-PRIM-NOME: '    WS-PRIM-NOME
    DISPLAY 'WS-NOME-MEIO: '    WS-NOME-MEIO
    DISPLAY 'WS-ULTI-NOME..: '  WS-ULTI-NOME
    DISPLAY 'WS-PONTEIRO....: ' WS-PONTEIRO
    DISPLAY 'WS-TOT-CAMPOS: '   WS-TOT-CAMPOS
    
    DISPLAY 'FORMA 3' 
    INITIALISE WS-NOME-COMPLETO
               WS-NOME
               WS-MOSTRA
 	             WS-COUNT

    MOVE '*MARIO CESAR;CASTRO' TO WS-NOME-COMPLETO

    MOVE 1 				            TO WS-PONTEIRO
    UNSTRING 
    WS-NOME-COMPLETO
    DELIMITED BY '*' OR ';'
    INTO WS-PRIM-NOME
         WS-NOME-MEIO
         WS-ULTI-NOME
    WITH POINTER WS-PONTEIRO
    TALLYING IN  WS-TOT-CAMPOS
    END-UNSTRING.

    DISPLAY 'WS-PRIM-NOME: '    WS-PRIM-NOME
    DISPLAY 'WS-NOME-MEIO: '    WS-NOME-MEIO
    DISPLAY 'WS-ULTI-NOME..: '  WS-ULTI-NOME
    DISPLAY 'WS-PONTEIRO....: ' WS-PONTEIRO
    DISPLAY 'WS-TOT-CAMPOS: '   WS-TOT-CAMPOS
    
    DISPLAY 'FORMA 4' 
    INITIALISE WS-NOME-COMPLETO
               WS-NOME
               WS-MOSTRA
 	             WS-COUNT

    MOVE 'MARIO;CESAR*CASTRO;' TO WS-NOME-COMPLETO

    MOVE 1 				             TO WS-PONTEIRO
    UNSTRING 
    WS-NOME-COMPLETO
    DELIMITED BY '*' OR ';'
    INTO WS-PRIM-NOME COUNT IN WS-TM-1
         WS-NOME-MEIO COUNT IN WS-TM-2
         WS-ULTI-NOME COUNT IN WS-TM-3
    WITH POINTER WS-PONTEIRO
    TALLYING IN  WS-TOT-CAMPOS
    END-UNSTRING.

    DISPLAY 'WS-PRIM-NOME: '    WS-PRIM-NOME
    DISPLAY 'WS-NOME-MEIO: '    WS-NOME-MEIO
    DISPLAY 'WS-ULTI-NOME..: '  WS-ULTI-NOME
    DISPLAY 'WS-PONTEIRO....: ' WS-PONTEIRO
    DISPLAY 'WS-TOT-CAMPOS: '   WS-TOT-CAMPOS
    DISPLAY 'WS-TM-1…………….: '   WS-TM-1
    DISPLAY 'WS-TM-2…………….: '   WS-TM-2
    DISPLAY 'WS-TM-3…………….: '   WS-TM-3
    
    DISPLAY 'FORMA 5' 
    INITIALISE WS-NOME-COMPLETO
               WS-NOME
               WS-MOSTRA
 	             WS-COUNT

    MOVE 'MARIO;;;;CESAR*CASTRO;' TO WS-NOME-COMPLETO

    MOVE 1 				                TO WS-PONTEIRO
    UNSTRING 
    WS-NOME-COMPLETO
    DELIMITED BY '*' OR ';'
    INTO WS-PRIM-NOME COUNT IN WS-TM-1
         WS-NOME-MEIO COUNT IN WS-TM-2
         WS-ULTI-NOME COUNT IN WS-TM-3
    WITH POINTER WS-PONTEIRO
    TALLYING IN  WS-TOT-CAMPOS
    END-UNSTRING.

    DISPLAY 'WS-PRIM-NOME: '    WS-PRIM-NOME
    DISPLAY 'WS-NOME-MEIO: '    WS-NOME-MEIO
    DISPLAY 'WS-ULTI-NOME..: '  WS-ULTI-NOME
    DISPLAY 'WS-PONTEIRO....: ' WS-PONTEIRO
    DISPLAY 'WS-TOT-CAMPOS: '   WS-TOT-CAMPOS
    DISPLAY 'WS-TM-1…………….: '   WS-TM-1
    DISPLAY 'WS-TM-2…………….: '   WS-TM-2
    DISPLAY 'WS-TM-3…………….: '   WS-TM-3

STOP RUN.


CONSOLE:
WS-PRIM-NOME: MARIO     
WS-NOME-MEIO: CESAR     
WS-ULTI-NOME: CASTRO    
FORMA 2
WS-PRIM-NOME: RIO       
WS-NOME-MEIO: CESAR     
WS-ULTI-NOME..: CASTRO    
WS-PONTEIRO....: 20
WS-TOT-CAMPOS: 03
FORMA 3
WS-PRIM-NOME:      
WS-NOME-MEIO: MARIO CESA     
WS-ULTI-NOME..: CASTRO    
WS-PONTEIRO....: 31
WS-TOT-CAMPOS: 03
FORMA 4
WS-PRIM-NOME: MARIO     
WS-NOME-MEIO: CESAR     
WS-ULTI-NOME..: CASTRO    
WS-PONTEIRO....: 20
WS-TOT-CAMPOS: 03
WS-TM-1…………….: 05
WS-TM-2…………….: 05
WS-TM-3…………….: 06
FORMA 5
WS-PRIM-NOME: MARIO     
WS-NOME-MEIO:           
WS-ULTI-NOME..:           
WS-PONTEIRO....: 09
WS-TOT-CAMPOS: 03
WS-TM-1…………….: 05
WS-TM-2…………….: 00
WS-TM-3…………….: 00
